ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/es/vsosh/ValidRequest_envelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header>
    </soapenv:Header>
       <soapenv:Body>
          <ns:VirksomhedStamOplysningSamlingHent_I revision="?">
             <ns:Kontekst>
                <ho:HovedOplysninger xmlns:ho="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <ho:TransaktionsID>TRANSACTION_ID</ho:TransaktionsID>
                    <ho:TransaktionsTid>INSERT_TID_HERE</ho:TransaktionsTid>
                </ho:HovedOplysninger>
             </ns:Kontekst>
             <ns:VirksomhedStamOplysningSamling>
                <ns:VirksomhedStamOplysning>
                   <ns:VirksomhedSENummer>INSERT_SE_NUMBER</ns:VirksomhedSENummer>
                   <ns:AleneStamOplysningMarkering>true</ns:AleneStamOplysningMarkering>
                </ns:VirksomhedStamOplysning>
             </ns:VirksomhedStamOplysningSamling>
          </ns:VirksomhedStamOplysningSamlingHent_I>
       </soapenv:Body>
</soapenv:Envelope>